[
  {
    "id": 0,
    "name": "Town Square",
    "description": "You stand in the bustling heart of Millhaven, where the town's two main roads intersect. A magnificent stone fountain depicting a silver stag sprays crystal-clear water into the air. Colorful market stalls line the edges of the square, and townsfolk go about their daily business. The air smells of fresh bread, spices, and the faint scent of forge smoke.",
    "exits": {
      "north": "1",
      "south": "2",
      "east": "3",
      "west": "4"
    },
    "objects": []
  },
  {
    "id": 1,
    "name": "North Road",
    "description": "You walk along Millhaven's main northern thoroughfare. Well-kept shops and businesses line both sides of the cobblestone street. Lampposts with enchanted blue flames cast a warm glow, and the sounds of commerce and conversation fill the air. The road continues north toward the residential district and south back to the town square.",
    "exits": {
      "north": "5",
      "south": "0",
      "east": "6",
      "west": "7"
    },
    "objects": []
  },
  {
    "id": 2,
    "name": "South Road",
    "description": "This southern stretch of Millhaven's main road leads toward the town gate and farming communities beyond. The buildings here are more practical - warehouses, stables, and workshops. Heavy wagons rumble along the wide street, and the air carries scents of hay, leather, and earth.",
    "exits": {
      "north": "0",
      "south": "8",
      "east": "9",
      "west": "10"
    },
    "objects": []
  },
  {
    "id": 3,
    "name": "East Road",
    "description": "The eastern road of Millhaven climbs gently toward the town's temple district. The architecture becomes more elegant here, with carved stone facades and well-tended flower boxes. The sounds of the busy town square fade behind you, replaced by peaceful quiet and occasional temple bells.",
    "exits": {
      "east": "11",
      "west": "0",
      "north": "6",
      "south": "9"
    },
    "objects": []
  },
  {
    "id": 4,
    "name": "West Road",
    "description": "Millhaven's western road descends toward the merchant and entertainment district. The atmosphere is lively here, with colorful banners advertising various establishments and the sound of music drifting from open doorways. The air smells of exotic spices, perfumes, and roasting meats.",
    "exits": {
      "west": "12",
      "east": "0",
      "north": "7",
      "south": "10"
    },
    "objects": []
  },
  {
    "id": 5,
    "name": "The Silver Stag Inn",
    "description": "This cozy, three-story inn boasts a sign depicting a majestic silver stag. Inside, the air is warm and filled with the rich aromas of roasted meat, fresh bread, and ale. A massive stone fireplace dominates the common room, where travelers and locals share stories at worn wooden tables. The innkeeper smiles warmly from behind a polished oak bar.",
    "exits": {
      "south": "1"
    },
    "objects": []
  },
  {
    "id": 6,
    "name": "Blacksmith's Forge",
    "description": "The heat hits you first as you enter Ironheart's Smithy. The orange glow of the forge illuminates tools and works in progress hanging from the walls. The rhythmic clang of hammer on anvil echoes through the space as the master blacksmith shapes glowing metal. Finished weapons and armor gleam on display racks, testaments to exceptional craftsmanship.",
    "exits": {
      "west": "1",
      "south": "3"
    },
    "objects": []
  },
  {
    "id": 7,
    "name": "The Mystic Emporium",
    "description": "A shop that seems larger inside than out. Shelves overflow with strange artifacts, crystal orbs, dusty tomes, and bottles of colorful liquids. The air smells of exotic incense and ozone. Magical lights float near the ceiling, casting shifting shadows. An elderly shopkeeper with knowing eyes watches you from behind a cluttered counter.",
    "exits": {
      "east": "1",
      "south": "4"
    },
    "objects": []
  },
  {
    "id": 8,
    "name": "Town Gate",
    "description": "You stand before Millhaven's main southern gate, a massive structure of oak and iron. Guards in the town's colors stand watch, inspecting wagons and travelers coming from the farmlands beyond. Beyond the gate, the road stretches into the distance, lined with fields and the dark edge of the Whispering Wood.",
    "exits": {
      "north": "2"
    },
    "objects": []
  },
  {
    "id": 9,
    "name": "Healing House",
    "description": "This clean, organized building serves as Millhaven's primary clinic. The scent of medicinal herbs and fresh linens fills the air. Sunlight streams through large windows, illuminating beds with recovering patients and shelves of carefully labeled remedies. A calm healer moves between patients with quiet efficiency.",
    "exits": {
      "north": "3",
      "west": "2"
    },
    "objects": []
  },
  {
    "id": 10,
    "name": "Stables & Cartwright",
    "description": "The sounds and smells of horses, leather, and wood shavings fill this practical establishment. Well-kept horses watch from their stalls while craftsmen repair wagons and harnesses. A friendly stablehand greets you, brushing sawdust from his apron as he approaches.",
    "exits": {
      "north": "4",
      "east": "2"
    },
    "objects": []
  },
  {
    "id": 11,
    "name": "Temple of the Dawn",
    "description": "Serenity envelops you in this beautiful temple dedicated to the goddess of light. Stained glass windows paint the marble floor in brilliant colors, and the air is sweet with incense. Quiet prayers echo softly in the vast space. Acolytes in white robes tend the altar adorned with fresh flowers and eternal candles.",
    "exits": {
      "west": "3"
    },
    "objects": []
  },
  {
    "id": 12,
    "name": "Market Square",
    "description": "A vibrant open-air market fills this western plaza. Dozens of colorful stalls offer everything from fresh produce to exotic imports. Merchants call out their wares while customers haggle cheerfully. The air is thick with the smells of spices, baked goods, and the sea breeze from distant ports.",
    "exits": {
      "east": "4"
    },
    "objects": []
  },
  {
    "id": 13,
    "name": "Moonlit Alley",
    "description": "This narrow passage runs behind the main western establishments. Though shadowy, it's clean and well-maintained, with ivy climbing the stone walls on either side. Enchanted silver lanterns cast a soft glow, giving the alley its name. You can hear the muffled sounds of the market and inn from here.",
    "exits": {
      "north": "7",
      "south": "10"
    },
    "objects": []
  },
  {
    "id": 14,
    "name": "Garden Walk",
    "description": "A peaceful path that winds between the eastern buildings, lined with flowering plants and aromatic herbs. Benches placed along the way offer rest and contemplation. The sounds of the temple bells and healing house create a tranquil atmosphere. Butterflies dance among the blossoms in the gentle breeze.",
    "exits": {
      "north": "6",
      "south": "9"
    },
    "objects": []
  }
]